In [111]:
import pandas as pd
import numpy as np

In [112]:
dict2 = { 
  'w': 2.5,
  'x': pd.Series(3.5, index=list(range(1000)), dtype='float'),
  'y': np.random.randn(1000),
  'z': np.random.randn(1000),
}
df3 = pd.DataFrame(dict2)
df3

       w    x         y         z
0    2.5  3.5  0.799368 -0.284968
1    2.5  3.5 -0.449330 -2.846641
2    2.5  3.5 -0.264630  0.058542
3    2.5  3.5  1.192995  0.942766
4    2.5  3.5  0.710820 -1.093206
..   ...  ...       ...       ...
995  2.5  3.5 -0.672624 -0.554999
996  2.5  3.5  1.590413  0.010290
997  2.5  3.5  0.858762  1.004206
998  2.5  3.5  0.849932  0.126054
999  2.5  3.5  0.197791 -0.074250

[1000 rows x 4 columns]

In [113]:
#select columns
df3.x
#OR
df3['x']
#OR
df3[['x','y']]

       x         y
0    3.5  0.799368
1    3.5 -0.449330
2    3.5 -0.264630
3    3.5  1.192995
4    3.5  0.710820
..   ...       ...
995  3.5 -0.672624
996  3.5  1.590413
997  3.5  0.858762
998  3.5  0.849932
999  3.5  0.197791

[1000 rows x 2 columns]

In [114]:
#series data type
type(df3['x'])

pandas.core.series.Series

In [115]:
type(df3[['x','y']])

pandas.core.frame.DataFrame

In [116]:
#if more than a column (list of columns ), then type data frame
type(df3[['x']])

pandas.core.frame.DataFrame

In [117]:
df3[['x','z']]

       x         z
0    3.5 -0.284968
1    3.5 -2.846641
2    3.5  0.058542
3    3.5  0.942766
4    3.5 -1.093206
..   ...       ...
995  3.5 -0.554999
996  3.5  0.010290
997  3.5  1.004206
998  3.5  0.126054
999  3.5 -0.074250

[1000 rows x 2 columns]

In [118]:
df3['x'] #series
df3[['x']] # dataframe 
df3[['x','y']] # dataframe

       x         y
0    3.5  0.799368
1    3.5 -0.449330
2    3.5 -0.264630
3    3.5  1.192995
4    3.5  0.710820
..   ...       ...
995  3.5 -0.672624
996  3.5  1.590413
997  3.5  0.858762
998  3.5  0.849932
999  3.5  0.197791

[1000 rows x 2 columns]

In [119]:
#retrieve first two rows
df3[0:2]

     w    x         y         z
0  2.5  3.5  0.799368 -0.284968
1  2.5  3.5 -0.449330 -2.846641

In [120]:
# i - row position 
# only second and fourth row
df3.iloc[[1,3]]

     w    x         y         z
1  2.5  3.5 -0.449330 -2.846641
3  2.5  3.5  1.192995  0.942766

In [121]:
#based on the above result, extract x and  z columns 
df3.iloc[[1,3], [1,3]]

     x         z
1  3.5 -2.846641
3  3.5  0.942766

In [122]:
df3.iloc[[1,3]] [['x','z']]

     x         z
1  3.5 -2.846641
3  3.5  0.942766

In [123]:
#extract the second row on to fifth row, second to last column
df3.iloc[1:5,1:]

     x         y         z
1  3.5 -0.449330 -2.846641
2  3.5 -0.264630  0.058542
3  3.5  1.192995  0.942766
4  3.5  0.710820 -1.093206

In [124]:
#iloc[] is used for slicing rows and columns based on position.
df3.iloc[1:5][['x','y','z']]

     x         y         z
1  3.5 -0.449330 -2.846641
2  3.5 -0.264630  0.058542
3  3.5  1.192995  0.942766
4  3.5  0.710820 -1.093206

In [125]:
df3.iloc[1:5][2:]

     w    x         y         z
3  2.5  3.5  1.192995  0.942766
4  2.5  3.5  0.710820 -1.093206

In [126]:
#loc [], means use the index __values__
#first change the index
df3.index = range(1000,2000)
df3.head()

        w    x         y         z
1000  2.5  3.5  0.799368 -0.284968
1001  2.5  3.5 -0.449330 -2.846641
1002  2.5  3.5 -0.264630  0.058542
1003  2.5  3.5  1.192995  0.942766
1004  2.5  3.5  0.710820 -1.093206

In [141]:
df3.loc[[1000,1001]]

        w    x         y         z
1000  2.5  3.5  0.799368 -0.284968
1001  2.5  3.5 -0.449330 -2.846641

In [128]:
df3.loc[[1000,1001],['x','z']]

        x         z
1000  3.5 -0.284968
1001  3.5 -2.846641

In [129]:
#second approach
df3.loc[[1000,1001]] [['x','z']]

        x         z
1000  3.5 -0.284968
1001  3.5 -2.846641

In [130]:
#four rows : 1001 to 1004 using loc()
df3.loc[1001:1004]

        w    x         y         z
1001  2.5  3.5 -0.449330 -2.846641
1002  2.5  3.5 -0.264630  0.058542
1003  2.5  3.5  1.192995  0.942766
1004  2.5  3.5  0.710820 -1.093206

In [131]:
#double bracket to specify only specific values 
#single bracket for ranges
df3.loc[1001:1004][['x','y']]

        x         y
1001  3.5 -0.449330
1002  3.5 -0.264630
1003  3.5  1.192995
1004  3.5  0.710820

In [132]:
#use column positions
df3.loc[1001:1004, df3.columns[1:3]]

        x         y
1001  3.5 -0.449330
1002  3.5 -0.264630
1003  3.5  1.192995
1004  3.5  0.710820

In [133]:
df3.loc[1001:1004,df3.columns[2]]

1001   -0.449330
1002   -0.264630
1003    1.192995
1004    0.710820
Name: y, dtype: float64

In [134]:
 df = pd.DataFrame(3 * np.random.rand(6, 3), 
                  index=[11, 22, 33, 44, 55, 66], 
                  columns=[4, 5, 6])
print(df)

           4         5         6
11  2.288931  1.107128  0.368298
22  2.618111  1.387357  1.453857
33  0.337063  2.153667  0.048282
44  1.895920  1.985369  0.120622
55  0.634414  1.486668  2.862371
66  2.028819  1.738266  0.024320

In [135]:
df[5] # 1. 2nd column  as series

11    1.107128
22    1.387357
33    2.153667
44    1.985369
55    1.486668
66    1.738266
Name: 5, dtype: float64

In [136]:
df[[5]]# 2. 2nd col as data frame

           5
11  1.107128
22  1.387357
33  2.153667
44  1.985369
55  1.486668
66  1.738266

In [137]:
df[[4,6]]#3. first and last columns

           4         6
11  2.288931  0.368298
22  2.618111  1.453857
33  0.337063  0.048282
44  1.895920  0.120622
55  0.634414  2.862371
66  2.028819  0.024320

In [138]:
df[df.columns[[0,-1]]] # first and last columns

           4         6
11  2.288931  0.368298
22  2.618111  1.453857
33  0.337063  0.048282
44  1.895920  0.120622
55  0.634414  2.862371
66  2.028819  0.024320

In [139]:
df.iloc[1:4] # second to fourth rows

           4         5         6
22  2.618111  1.387357  1.453857
33  0.337063  2.153667  0.048282
44  1.895920  1.985369  0.120622

In [140]:
#last 2 columns in the last 2 row
df.iloc[-2:,-2:]

           5         6
55  1.486668  2.862371
66  1.738266  0.024320